create_clock -period 100.000 -name VIRTUAL_uart_ck_clk_wiz_clocks -waveform {0.000 50.000}

set_input_delay -clock [get_clocks sys_clk_p] -min -add_delay 0.000 [get_ports btn_reset]
set_input_delay -clock [get_clocks sys_clk_p] -max -add_delay 0.500 [get_ports btn_reset]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports rx_ser]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -max -add_delay 70.000 [get_ports rx_ser]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports adc_ck]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports adc_ck]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports adc_start]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports adc_start]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports dac_sck]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports dac_sck]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports dac_sdin]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports dac_sdin]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports inj_stb]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports inj_stb]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports sel_init_n]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports sel_init_n]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports ser_ck]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports ser_ck]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports ser_read]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports ser_read]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks sys_clk_p] -min -add_delay -0.500 [get_ports slow_ctrl_reset_n]
set_output_delay -clock [get_clocks sys_clk_p] -max -add_delay 2.500 [get_ports slow_ctrl_reset_n]

set_property IOSTANDARD LVCMOS12 [get_ports sel_ckcol]
set_property IOSTANDARD LVCMOS12 [get_ports sel_ckrow]
set_property IOSTANDARD LVCMOS12 [get_ports sel_init_n]
set_property IOSTANDARD LVCMOS12 [get_ports ser_ck]
set_property IOSTANDARD LVCMOS12 [get_ports ser_out]
set_property IOSTANDARD LVCMOS12 [get_ports ser_read]
set_property IOSTANDARD LVCMOS12 [get_ports ser_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_inf]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_sup]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_ck]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_in]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports tx_ser]
set_property IOSTANDARD LVCMOS12 [get_ports adc_ck]
set_property IOSTANDARD LVCMOS12 [get_ports adc_start]
set_property IOSTANDARD LVCMOS12 [get_ports csa_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sck]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sdin]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sync_n]
set_property IOSTANDARD LVCMOS12 [get_ports inj_stb]
set_property IOSTANDARD LVCMOS12 [get_ports rx_ser]

set_property CONFIG_VOLTAGE 1.8 [current_design]
set_property CFGBVS GND [current_design]

set_property DRIVE 12 [get_ports adc_ck]
set_property SLEW SLOW [get_ports dac_sync_n]
set_property SLEW SLOW [get_ports ser_ck]
set_property SLEW SLOW [get_ports adc_start]
set_property SLEW SLOW [get_ports csa_reset_n]
set_property SLEW SLOW [get_ports dac_sck]
set_property SLEW SLOW [get_ports dac_sdin]
set_property SLEW SLOW [get_ports adc_ck]
set_property SLEW SLOW [get_ports inj_stb]
set_property SLEW SLOW [get_ports sel_ckcol]
set_property SLEW SLOW [get_ports sel_ckrow]
set_property SLEW SLOW [get_ports sel_init_n]
set_property SLEW SLOW [get_ports ser_read]
set_property SLEW SLOW [get_ports ser_reset_n]
set_property SLEW SLOW [get_ports sh_phi1d_inf]
set_property SLEW SLOW [get_ports sh_phi1d_sup]
set_property SLEW SLOW [get_ports slow_ctrl_ck]
set_property SLEW SLOW [get_ports slow_ctrl_in]
set_property SLEW SLOW [get_ports slow_ctrl_reset_n]
set_property SLEW SLOW [get_ports tx_ser]

set_property PACKAGE_PIN H30 [get_ports dac_sdin]
set_property PACKAGE_PIN G30 [get_ports dac_sync_n]
set_property PACKAGE_PIN H26 [get_ports sel_init_n]
set_property PACKAGE_PIN H27 [get_ports sel_ckrow]
set_property PACKAGE_PIN F25 [get_ports ser_read]
set_property PACKAGE_PIN E25 [get_ports ser_ck]
set_property PACKAGE_PIN A25 [get_ports csa_reset_n]
set_property PACKAGE_PIN A26 [get_ports adc_ck]
set_property PACKAGE_PIN B23 [get_ports adc_start]
set_property PACKAGE_PIN A23 [get_ports sh_phi1d_sup]
set_property PACKAGE_PIN H21 [get_ports sh_phi1d_inf]
set_property PACKAGE_PIN H22 [get_ports slow_ctrl_in]
set_property PACKAGE_PIN L17 [get_ports slow_ctrl_reset_n]
set_property PACKAGE_PIN L18 [get_ports slow_ctrl_ck]
set_property PACKAGE_PIN E29 [get_ports dac_sck]
set_property PACKAGE_PIN E30 [get_ports sel_ckcol]
set_property PACKAGE_PIN C29 [get_ports ser_out]
set_property PACKAGE_PIN B29 [get_ports ser_reset_n]
set_property PACKAGE_PIN F26 [get_ports inj_stb]

set_property PACKAGE_PIN E18 [get_ports rx_ser]
set_property PACKAGE_PIN B19 [get_ports tx_ser]

#connect_debug_port dbg_hub/clk [get_nets ila_ck]