# BACK TO NOT TWISTED
set_property CONFIG_VOLTAGE 1.8 [current_design]
set_property CFGBVS GND [current_design]

# In TS boards, due to DRIVER_SOT_P2 pinoout is different
set_property PACKAGE_PIN H30 [get_ports dac_sdin]
set_property PACKAGE_PIN G30 [get_ports dac_sync_n]
set_property PACKAGE_PIN E29 [get_ports dac_sck]
set_property PACKAGE_PIN E30 [get_ports sel_ckcol]
set_property PACKAGE_PIN H26 [get_ports sel_init_n]
set_property PACKAGE_PIN H27 [get_ports sel_ckrow]
set_property PACKAGE_PIN C29 [get_ports ser_out]
set_property PACKAGE_PIN B29 [get_ports ser_reset_n]
set_property PACKAGE_PIN F25 [get_ports ser_read]
set_property PACKAGE_PIN E25 [get_ports ser_ck]
set_property PACKAGE_PIN F26 [get_ports inj_stb]
set_property PACKAGE_PIN A25 [get_ports csa_reset_n]
set_property PACKAGE_PIN A26 [get_ports adc_ck]
set_property PACKAGE_PIN B23 [get_ports adc_start]
#======================================================================================
# Due to unproper layout AD26 (slow_ctrl_in) and AC26 (sh_phi1d_inf) are shorted on PCB
#  on TS boards
# AC24 is not connected as it is DRIVER_SOT_P2
# sh_phi1d_sup goes where inf should be to make use of the additional pin
set_property PACKAGE_PIN A23 [get_ports sh_phi1d_sup]
# sh_phi1d_inf = slow_ctrl_in due to short H21 = H22
set_property PACKAGE_PIN H21 [get_ports sh_phi1d_inf]
set_property PACKAGE_PIN H22 [get_ports slow_ctrl_in]
#======================================================================================
set_property PACKAGE_PIN L17 [get_ports slow_ctrl_reset_n]
set_property PACKAGE_PIN L18 [get_ports slow_ctrl_ck]

set_property PACKAGE_PIN R19 [get_ports btn_reset]
set_property PACKAGE_PIN Y20 [get_ports rx_ser]
set_property PACKAGE_PIN Y23 [get_ports tx_ser]

set_property IOSTANDARD LVCMOS12 [get_ports adc_ck]
set_property IOSTANDARD LVCMOS12 [get_ports adc_start]
set_property IOSTANDARD LVCMOS12 [get_ports csa_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sck]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sdin]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sync_n]
set_property IOSTANDARD LVCMOS12 [get_ports inj_stb]
set_property IOSTANDARD LVCMOS12 [get_ports sel_ckcol]
set_property IOSTANDARD LVCMOS12 [get_ports sel_ckrow]
set_property IOSTANDARD LVCMOS12 [get_ports sel_init_n]
set_property IOSTANDARD LVCMOS12 [get_ports ser_ck]
set_property IOSTANDARD LVCMOS12 [get_ports ser_out]
set_property IOSTANDARD LVCMOS12 [get_ports ser_read]
set_property IOSTANDARD LVCMOS12 [get_ports ser_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_inf]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_sup]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_ck]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_in]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_reset_n]
set_property IOSTANDARD LVCMOS33 [get_ports btn_reset]
set_property IOSTANDARD LVCMOS33 [get_ports rx_ser]
set_property IOSTANDARD LVCMOS33 [get_ports tx_ser]
set_property PULLTYPE PULLDOWN [get_ports adc_ck]
set_property PULLTYPE PULLDOWN [get_ports adc_start]
set_property PULLTYPE PULLDOWN [get_ports btn_reset]
set_property PULLTYPE PULLDOWN [get_ports csa_reset_n]
set_property PULLTYPE PULLDOWN [get_ports dac_sck]
set_property PULLTYPE PULLDOWN [get_ports dac_sdin]
set_property PULLTYPE PULLDOWN [get_ports inj_stb]
set_property PULLTYPE PULLDOWN [get_ports sel_ckcol]
set_property PULLTYPE PULLDOWN [get_ports sel_ckrow]
set_property PULLTYPE PULLDOWN [get_ports ser_ck]
set_property PULLTYPE PULLDOWN [get_ports ser_read]
set_property PULLTYPE PULLDOWN [get_ports ser_reset_n]
set_property PULLTYPE PULLDOWN [get_ports sh_phi1d_inf]
set_property PULLTYPE PULLDOWN [get_ports sh_phi1d_sup]
set_property PULLTYPE PULLDOWN [get_ports slow_ctrl_ck]
set_property PULLTYPE PULLDOWN [get_ports slow_ctrl_in]
set_property PULLTYPE PULLDOWN [get_ports slow_ctrl_reset_n]
set_property PULLTYPE PULLUP [get_ports dac_sync_n]
set_property PULLTYPE PULLUP [get_ports rx_ser]
set_property PULLTYPE PULLUP [get_ports sel_init_n]
set_property PULLTYPE PULLUP [get_ports tx_ser]
set_property SLEW FAST [get_ports inj_stb]
set_property SLEW SLOW [get_ports adc_ck]
set_property SLEW SLOW [get_ports adc_start]
set_property SLEW SLOW [get_ports csa_reset_n]
set_property SLEW SLOW [get_ports dac_sck]
set_property SLEW SLOW [get_ports dac_sdin]
set_property SLEW SLOW [get_ports dac_sync_n]
set_property SLEW SLOW [get_ports sel_ckcol]
set_property SLEW SLOW [get_ports sel_ckrow]
set_property SLEW SLOW [get_ports sel_init_n]
set_property SLEW SLOW [get_ports ser_ck]
set_property SLEW SLOW [get_ports ser_read]
set_property SLEW SLOW [get_ports ser_reset_n]
set_property SLEW SLOW [get_ports sh_phi1d_inf]
set_property SLEW SLOW [get_ports sh_phi1d_sup]
set_property SLEW SLOW [get_ports slow_ctrl_ck]
set_property SLEW SLOW [get_ports slow_ctrl_in]
set_property SLEW SLOW [get_ports slow_ctrl_reset_n]
set_property SLEW SLOW [get_ports tx_ser]

set_property DRIVE 8 [get_ports adc_ck]
set_property DRIVE 8 [get_ports adc_start]
set_property DRIVE 8 [get_ports csa_reset_n]
set_property DRIVE 8 [get_ports dac_sck]
set_property DRIVE 8 [get_ports dac_sdin]
set_property DRIVE 8 [get_ports dac_sync_n]
set_property DRIVE 8 [get_ports inj_stb]
set_property DRIVE 8 [get_ports sel_ckcol]
set_property DRIVE 8 [get_ports sel_ckrow]
set_property DRIVE 8 [get_ports sel_init_n]
set_property DRIVE 8 [get_ports ser_ck]
set_property DRIVE 8 [get_ports ser_read]
set_property DRIVE 8 [get_ports ser_reset_n]
set_property DRIVE 8 [get_ports sh_phi1d_inf]
set_property DRIVE 8 [get_ports sh_phi1d_sup]
set_property DRIVE 8 [get_ports slow_ctrl_ck]
set_property DRIVE 8 [get_ports slow_ctrl_in]
set_property DRIVE 8 [get_ports slow_ctrl_reset_n]
set_property DRIVE 8 [get_ports tx_ser]

#sample
set_property PACKAGE_PIN J23 [get_ports csa_reset_n_out]
set_property IOSTANDARD LVCMOS12 [get_ports csa_reset_n_out]
set_property SLEW FAST [get_ports csa_reset_n_out]
set_property PULLTYPE PULLDOWN [get_ports csa_reset_n_out]
#end sample

create_clock -period 4.999 -name VIRTUAL_daq_ck_clk_wiz_clocks -waveform {0.000 2.500}
create_clock -period 99.990 -name VIRTUAL_uart_ck_clk_wiz_clocks -waveform {0.000 49.995}
set_input_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 2.000 [get_ports btn_reset]
set_input_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 2.000 [get_ports btn_reset]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -min -add_delay 20.000 [get_ports rx_ser]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -max -add_delay 20.000 [get_ports rx_ser]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports adc_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports adc_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports adc_start]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports adc_start]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports dac_sck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports dac_sck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports dac_sdin]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports dac_sdin]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports inj_stb]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports inj_stb]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports sel_init_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports sel_init_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports ser_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports ser_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports ser_read]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports ser_read]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports slow_ctrl_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 1.000 [get_ports slow_ctrl_reset_n]


set_property OFFCHIP_TERM FP_VTT_50 [get_ports csa_reset_n]
set_property C_CLK_INPUT_FREQ_HZ 300000000 [get_debug_cores dbg_hub]
set_property C_ENABLE_CLK_DIVIDER false [get_debug_cores dbg_hub]
set_property C_USER_SCAN_CHAIN 1 [get_debug_cores dbg_hub]
connect_debug_port dbg_hub/clk [get_nets daq_ck]
