set_property PACKAGE_PIN AA18 [get_ports adc_ck]
set_property IOSTANDARD LVCMOS12 [get_ports adc_ck]
set_property SLEW SLOW [get_ports adc_ck]
set_property PULLDOWN true [get_ports adc_ck]
set_property PACKAGE_PIN AB24 [get_ports adc_start]
set_property IOSTANDARD LVCMOS12 [get_ports adc_start]
set_property SLEW SLOW [get_ports adc_start]
set_property PULLDOWN true [get_ports adc_start]
set_property PACKAGE_PIN B9 [get_ports btn_reset]
set_property IOSTANDARD LVCMOS33 [get_ports btn_reset]
set_property PULLDOWN true [get_ports btn_reset]
set_property PACKAGE_PIN Y18 [get_ports csa_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports csa_reset_n]
set_property SLEW SLOW [get_ports csa_reset_n]
set_property PULLDOWN true [get_ports csa_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sck]
set_property SLEW SLOW [get_ports dac_sck]
set_property PACKAGE_PIN AB17 [get_ports dac_sck]
set_property PULLDOWN true [get_ports dac_sck]
set_property PACKAGE_PIN Y17 [get_ports dac_sdin]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sdin]
set_property SLEW SLOW [get_ports dac_sdin]
set_property PULLDOWN true [get_ports dac_sdin]
set_property PACKAGE_PIN AA17 [get_ports dac_sync_n]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sync_n]
set_property SLEW SLOW [get_ports dac_sync_n]
set_property PULLUP true [get_ports dac_sync_n]
set_property PACKAGE_PIN AC22 [get_ports inj_stb]
set_property IOSTANDARD LVCMOS12 [get_ports inj_stb]
set_property SLEW FAST [get_ports inj_stb]
set_property PULLDOWN true [get_ports inj_stb]
set_property PACKAGE_PIN W12 [get_ports rx_ser]
set_property IOSTANDARD LVCMOS33 [get_ports rx_ser]
set_property PULLUP true [get_ports rx_ser]
set_property PACKAGE_PIN AC17 [get_ports sel_ckcol]
set_property IOSTANDARD LVCMOS12 [get_ports sel_ckcol]
set_property SLEW SLOW [get_ports sel_ckcol]
set_property PULLDOWN true [get_ports sel_ckcol]
set_property PACKAGE_PIN AF23 [get_ports sel_ckrow]
set_property IOSTANDARD LVCMOS12 [get_ports sel_ckrow]
set_property SLEW SLOW [get_ports sel_ckrow]
set_property PULLDOWN true [get_ports sel_ckrow]
set_property PACKAGE_PIN AA20 [get_ports sel_init_n]
set_property IOSTANDARD LVCMOS12 [get_ports sel_init_n]
set_property SLEW SLOW [get_ports sel_init_n]
set_property PULLUP true [get_ports sel_init_n]
set_property PACKAGE_PIN AE16 [get_ports ser_ck]
set_property IOSTANDARD LVCMOS12 [get_ports ser_ck]
set_property SLEW SLOW [get_ports ser_ck]
set_property PULLDOWN true [get_ports ser_ck]
set_property PACKAGE_PIN AE17 [get_ports ser_out]
set_property IOSTANDARD LVCMOS12 [get_ports ser_out]
set_property PACKAGE_PIN AD16 [get_ports ser_read]
set_property IOSTANDARD LVCMOS12 [get_ports ser_read]
set_property SLEW SLOW [get_ports ser_read]
set_property PULLDOWN true [get_ports ser_read]
set_property PACKAGE_PIN AF17 [get_ports ser_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports ser_reset_n]
set_property SLEW SLOW [get_ports ser_reset_n]
set_property PULLDOWN true [get_ports ser_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_inf]
set_property SLEW SLOW [get_ports sh_phi1d_inf]
set_property PULLDOWN true [get_ports sh_phi1d_inf]
set_property PACKAGE_PIN AC26 [get_ports sh_phi1d_inf]
set_property PACKAGE_PIN AC24 [get_ports sh_phi1d_sup]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_sup]
set_property SLEW SLOW [get_ports sh_phi1d_sup]
set_property PULLDOWN true [get_ports sh_phi1d_sup]
set_property PACKAGE_PIN AB26 [get_ports slow_ctrl_ck]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_ck]
set_property SLEW SLOW [get_ports slow_ctrl_ck]
set_property PULLDOWN true [get_ports slow_ctrl_ck]
set_property PACKAGE_PIN AD26 [get_ports slow_ctrl_in]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_in]
set_property SLEW SLOW [get_ports slow_ctrl_in]
set_property PULLDOWN true [get_ports slow_ctrl_in]
set_property PACKAGE_PIN AB25 [get_ports slow_ctrl_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_reset_n]
set_property SLEW SLOW [get_ports slow_ctrl_reset_n]
set_property PULLDOWN true [get_ports slow_ctrl_reset_n]
set_property PACKAGE_PIN W13 [get_ports tx_ser]
set_property IOSTANDARD LVCMOS33 [get_ports tx_ser]
set_property SLEW SLOW [get_ports tx_ser]
set_property PULLUP true [get_ports tx_ser]

create_clock -period 4.999 -name VIRTUAL_daq_ck_clk_wiz_clocks -waveform {0.000 2.500}
create_clock -period 99.990 -name VIRTUAL_uart_ck_clk_wiz_clocks -waveform {0.000 49.995}

set_input_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 2.000 [get_ports btn_reset]
set_input_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 2.999 [get_ports btn_reset]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -min -add_delay 30.000 [get_ports rx_ser]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -max -add_delay 69.990 [get_ports rx_ser]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports adc_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports adc_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports adc_start]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports adc_start]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports dac_sck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports dac_sck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports dac_sdin]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports dac_sdin]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sel_init_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sel_init_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports ser_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports ser_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports ser_read]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports ser_read]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 3.000 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports slow_ctrl_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports slow_ctrl_reset_n]

set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 1.000 [get_ports inj_stb]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.999 [get_ports inj_stb]

