set_property PACKAGE_PIN AB26 [get_ports dac_sdin]
set_property PACKAGE_PIN AB25 [get_ports dac_sync_n]
set_property PACKAGE_PIN AD26 [get_ports dac_sck]
set_property PACKAGE_PIN AC26 [get_ports sel_ckcol]
set_property PACKAGE_PIN AC24 [get_ports sel_init_n]
set_property PACKAGE_PIN AB24 [get_ports sel_ckrow]
set_property PACKAGE_PIN AA18 [get_ports ser_out]
set_property PACKAGE_PIN Y18  [get_ports ser_reset_n]
set_property PACKAGE_PIN AC22 [get_ports ser_read]
set_property PACKAGE_PIN AE16 [get_ports ser_ck]
set_property PACKAGE_PIN Y17  [get_ports inj_stb]
set_property PACKAGE_PIN AF17 [get_ports csa_reset_n]
set_property PACKAGE_PIN AE17 [get_ports adc_ck]
set_property PACKAGE_PIN AB20 [get_ports adc_start]
set_property PACKAGE_PIN AA20 [get_ports sh_phi1d_sup]
set_property PACKAGE_PIN AC17 [get_ports sh_phi1d_inf]
set_property PACKAGE_PIN AB17 [get_ports slow_ctrl_in]
set_property PACKAGE_PIN AA17 [get_ports slow_ctrl_reset_n]
set_property PACKAGE_PIN AA19 [get_ports slow_ctrl_ck]

set_property PACKAGE_PIN B9 [get_ports btn_reset]
set_property PACKAGE_PIN W12 [get_ports rx_ser]
set_property PACKAGE_PIN W13 [get_ports tx_ser]

set_property IOSTANDARD LVCMOS12 [get_ports adc_ck]
set_property IOSTANDARD LVCMOS12 [get_ports adc_start]
set_property IOSTANDARD LVCMOS12 [get_ports csa_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sck]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sdin]
set_property IOSTANDARD LVCMOS12 [get_ports dac_sync_n]
set_property IOSTANDARD LVCMOS12 [get_ports inj_stb]
set_property IOSTANDARD LVCMOS12 [get_ports sel_ckcol]
set_property IOSTANDARD LVCMOS12 [get_ports sel_ckrow]
set_property IOSTANDARD LVCMOS12 [get_ports sel_init_n]
set_property IOSTANDARD LVCMOS12 [get_ports ser_ck]
set_property IOSTANDARD LVCMOS12 [get_ports ser_out]
set_property IOSTANDARD LVCMOS12 [get_ports ser_read]
set_property IOSTANDARD LVCMOS12 [get_ports ser_reset_n]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_inf]
set_property IOSTANDARD LVCMOS12 [get_ports sh_phi1d_sup]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_ck]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_in]
set_property IOSTANDARD LVCMOS12 [get_ports slow_ctrl_reset_n]
set_property IOSTANDARD LVCMOS33 [get_ports btn_reset]
set_property IOSTANDARD LVCMOS33 [get_ports rx_ser]
set_property IOSTANDARD LVCMOS33 [get_ports tx_ser]
set_property PULLTYPE PULLDOWN [get_ports adc_ck]
set_property PULLTYPE PULLDOWN [get_ports adc_start]
set_property PULLTYPE PULLDOWN [get_ports btn_reset]
set_property PULLTYPE PULLDOWN [get_ports csa_reset_n]
set_property PULLTYPE PULLDOWN [get_ports dac_sck]
set_property PULLTYPE PULLDOWN [get_ports dac_sdin]
set_property PULLTYPE PULLDOWN [get_ports inj_stb]
set_property PULLTYPE PULLDOWN [get_ports sel_ckcol]
set_property PULLTYPE PULLDOWN [get_ports sel_ckrow]
set_property PULLTYPE PULLDOWN [get_ports ser_ck]
set_property PULLTYPE PULLDOWN [get_ports ser_read]
set_property PULLTYPE PULLDOWN [get_ports ser_reset_n]
set_property PULLTYPE PULLDOWN [get_ports sh_phi1d_inf]
set_property PULLTYPE PULLDOWN [get_ports sh_phi1d_sup]
set_property PULLTYPE PULLDOWN [get_ports slow_ctrl_ck]
set_property PULLTYPE PULLDOWN [get_ports slow_ctrl_in]
set_property PULLTYPE PULLDOWN [get_ports slow_ctrl_reset_n]
set_property PULLTYPE PULLUP [get_ports dac_sync_n]
set_property PULLTYPE PULLUP [get_ports rx_ser]
set_property PULLTYPE PULLUP [get_ports sel_init_n]
set_property PULLTYPE PULLUP [get_ports tx_ser]
set_property SLEW FAST [get_ports inj_stb]
set_property SLEW SLOW [get_ports adc_ck]
set_property SLEW SLOW [get_ports adc_start]
set_property SLEW SLOW [get_ports csa_reset_n]
set_property SLEW SLOW [get_ports dac_sck]
set_property SLEW SLOW [get_ports dac_sdin]
set_property SLEW SLOW [get_ports dac_sync_n]
set_property SLEW SLOW [get_ports sel_ckcol]
set_property SLEW SLOW [get_ports sel_ckrow]
set_property SLEW SLOW [get_ports sel_init_n]
set_property SLEW SLOW [get_ports ser_ck]
set_property SLEW SLOW [get_ports ser_read]
set_property SLEW SLOW [get_ports ser_reset_n]
set_property SLEW SLOW [get_ports sh_phi1d_inf]
set_property SLEW SLOW [get_ports sh_phi1d_sup]
set_property SLEW SLOW [get_ports slow_ctrl_ck]
set_property SLEW SLOW [get_ports slow_ctrl_in]
set_property SLEW SLOW [get_ports slow_ctrl_reset_n]
set_property SLEW SLOW [get_ports tx_ser]

create_clock -period 4.999 -name VIRTUAL_daq_ck_clk_wiz_clocks -waveform {0.000 2.500}
create_clock -period 99.990 -name VIRTUAL_uart_ck_clk_wiz_clocks -waveform {0.000 49.995}

set_input_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 2.000 [get_ports btn_reset]
set_input_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 2.999 [get_ports btn_reset]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -min -add_delay 30.000 [get_ports rx_ser]
set_input_delay -clock [get_clocks VIRTUAL_uart_ck_clk_wiz_clocks] -max -add_delay 69.990 [get_ports rx_ser]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports adc_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports adc_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports adc_start]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports adc_start]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports csa_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports dac_sck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports dac_sck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports dac_sdin]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports dac_sdin]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports dac_sync_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sel_ckcol]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sel_ckrow]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sel_init_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sel_init_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports ser_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports ser_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports ser_read]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports ser_read]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports ser_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sh_phi1d_inf]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports sh_phi1d_sup]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports slow_ctrl_ck]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min -add_delay 0.000 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max -add_delay 3.000 [get_ports slow_ctrl_in]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 0.000 [get_ports slow_ctrl_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.000 [get_ports slow_ctrl_reset_n]

set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -min 1.000 [get_ports inj_stb]
set_output_delay -clock [get_clocks VIRTUAL_daq_ck_clk_wiz_clocks] -max 3.999 [get_ports inj_stb]



set_property DRIVE 8 [get_ports adc_ck]

set_property DRIVE 8 [get_ports adc_start]
set_property DRIVE 8 [get_ports csa_reset_n]
set_property DRIVE 8 [get_ports dac_sck]
set_property DRIVE 8 [get_ports dac_sdin]
set_property DRIVE 8 [get_ports dac_sync_n]
set_property DRIVE 8 [get_ports inj_stb]
set_property DRIVE 8 [get_ports sel_ckcol]
set_property DRIVE 8 [get_ports sel_ckrow]
set_property DRIVE 8 [get_ports sel_init_n]
set_property DRIVE 8 [get_ports ser_ck]
set_property DRIVE 8 [get_ports ser_read]
set_property DRIVE 8 [get_ports ser_reset_n]
set_property DRIVE 8 [get_ports sh_phi1d_inf]
set_property DRIVE 8 [get_ports sh_phi1d_sup]
set_property DRIVE 8 [get_ports slow_ctrl_ck]
set_property DRIVE 8 [get_ports slow_ctrl_in]
set_property DRIVE 8 [get_ports slow_ctrl_reset_n]
set_property DRIVE 8 [get_ports tx_ser]

create_debug_core u_ila_0 ila
set_property ALL_PROBE_SAME_MU true [get_debug_cores u_ila_0]
set_property ALL_PROBE_SAME_MU_CNT 1 [get_debug_cores u_ila_0]
set_property C_ADV_TRIGGER false [get_debug_cores u_ila_0]
set_property C_DATA_DEPTH 2048 [get_debug_cores u_ila_0]
set_property C_EN_STRG_QUAL false [get_debug_cores u_ila_0]
set_property C_INPUT_PIPE_STAGES 0 [get_debug_cores u_ila_0]
set_property C_TRIGIN_EN false [get_debug_cores u_ila_0]
set_property C_TRIGOUT_EN false [get_debug_cores u_ila_0]
set_property port_width 1 [get_debug_ports u_ila_0/clk]
connect_debug_port u_ila_0/clk [get_nets [list daq_ck]]
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe0]
set_property port_width 1 [get_debug_ports u_ila_0/probe0]
connect_debug_port u_ila_0/probe0 [get_nets [list adc_ck_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe1]
set_property port_width 1 [get_debug_ports u_ila_0/probe1]
connect_debug_port u_ila_0/probe1 [get_nets [list adc_start_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe2]
set_property port_width 1 [get_debug_ports u_ila_0/probe2]
connect_debug_port u_ila_0/probe2 [get_nets [list csa_reset_n_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe3]
set_property port_width 1 [get_debug_ports u_ila_0/probe3]
connect_debug_port u_ila_0/probe3 [get_nets [list dac_sck_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe4]
set_property port_width 1 [get_debug_ports u_ila_0/probe4]
connect_debug_port u_ila_0/probe4 [get_nets [list dac_sdin_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe5]
set_property port_width 1 [get_debug_ports u_ila_0/probe5]
connect_debug_port u_ila_0/probe5 [get_nets [list dac_sync_n_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe6]
set_property port_width 1 [get_debug_ports u_ila_0/probe6]
connect_debug_port u_ila_0/probe6 [get_nets [list inj_stb_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe7]
set_property port_width 1 [get_debug_ports u_ila_0/probe7]
connect_debug_port u_ila_0/probe7 [get_nets [list sel_ckcol_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe8]
set_property port_width 1 [get_debug_ports u_ila_0/probe8]
connect_debug_port u_ila_0/probe8 [get_nets [list sel_ckrow_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe9]
set_property port_width 1 [get_debug_ports u_ila_0/probe9]
connect_debug_port u_ila_0/probe9 [get_nets [list sel_init_n_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe10]
set_property port_width 1 [get_debug_ports u_ila_0/probe10]
connect_debug_port u_ila_0/probe10 [get_nets [list ser_ck_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe11]
set_property port_width 1 [get_debug_ports u_ila_0/probe11]
connect_debug_port u_ila_0/probe11 [get_nets [list ser_read_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe12]
set_property port_width 1 [get_debug_ports u_ila_0/probe12]
connect_debug_port u_ila_0/probe12 [get_nets [list ser_reset_n_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe13]
set_property port_width 1 [get_debug_ports u_ila_0/probe13]
connect_debug_port u_ila_0/probe13 [get_nets [list sh_phi1d_inf_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe14]
set_property port_width 1 [get_debug_ports u_ila_0/probe14]
connect_debug_port u_ila_0/probe14 [get_nets [list sh_phi1d_sup_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe15]
set_property port_width 1 [get_debug_ports u_ila_0/probe15]
connect_debug_port u_ila_0/probe15 [get_nets [list slow_ctrl_ck_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe16]
set_property port_width 1 [get_debug_ports u_ila_0/probe16]
connect_debug_port u_ila_0/probe16 [get_nets [list slow_ctrl_in_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe17]
set_property port_width 1 [get_debug_ports u_ila_0/probe17]
connect_debug_port u_ila_0/probe17 [get_nets [list slow_ctrl_reset_n_OBUF]]
create_debug_core u_ila_1 ila
set_property ALL_PROBE_SAME_MU true [get_debug_cores u_ila_1]
set_property ALL_PROBE_SAME_MU_CNT 1 [get_debug_cores u_ila_1]
set_property C_ADV_TRIGGER false [get_debug_cores u_ila_1]
set_property C_DATA_DEPTH 2048 [get_debug_cores u_ila_1]
set_property C_EN_STRG_QUAL false [get_debug_cores u_ila_1]
set_property C_INPUT_PIPE_STAGES 0 [get_debug_cores u_ila_1]
set_property C_TRIGIN_EN false [get_debug_cores u_ila_1]
set_property C_TRIGOUT_EN false [get_debug_cores u_ila_1]
set_property port_width 1 [get_debug_ports u_ila_1/clk]
connect_debug_port u_ila_1/clk [get_nets [list uart_ck]]
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_1/probe0]
set_property port_width 1 [get_debug_ports u_ila_1/probe0]
connect_debug_port u_ila_1/probe0 [get_nets [list uart_valid]]
set_property C_CLK_INPUT_FREQ_HZ 300000000 [get_debug_cores dbg_hub]
set_property C_ENABLE_CLK_DIVIDER false [get_debug_cores dbg_hub]
set_property C_USER_SCAN_CHAIN 1 [get_debug_cores dbg_hub]
connect_debug_port dbg_hub/clk [get_nets daq_ck]
